//Вывести на экран четные числа от 1 до N

int i=0;
int N=20;
while(i<=N)
{
    Console.WriteLine($"{i}");
    i=i+2;
}