//Вывести на экран числа от -N до N
int N1 = -20;
int N2 = 20;
while(N1<=N2)
{
    Console.WriteLine($"{N1}");
    N1 = N1 + 1;
}
